artilleryPostReviews.yaml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 100
scenarios:
  - flow:
    - post:
        url: "/reviews"
        json: {
   "product_id": 1,
   "rating": 5,
   "summary": "this is the summary for the newest product",
   "body": "continued text from the summary and can be soooo much longer if it wants to or needs to be",
   "recommend": false,
   "name": "cjohansen",
   "email": "ccsailor11@gmail.com",
   "photos": [
      "www.gasdf.com",
      "www.3jladsf.com"
   ],
   "characteristics": {
      "Length": 333,
      "Comfort": 111,
      "Fit": 333,
      "Quality": 222
   }
}

# $(npm bin)/artillery run artilleryPostReviews.yaml